Catalogs/ВидыОплатОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ВидыОплатОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентБанковскойКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыОплатОрганизаций/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СчетУчетаРасчетовПоУмолчанию(ТипОплаты) Экспорт

	СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	
	Если ТипОплаты = Перечисления.ТипыОплат.ПодарочныйСертификатСобственный Тогда
		СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным;
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплат.ПодарочныйСертификатСторонний Тогда
		СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплат.ПлатежнаяКарта Тогда
		СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплат.БанковскийКредит Тогда
		СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками;
	КонецЕсли;
	
	Возврат СчетУчетаРасчетов;

КонецФункции

Функция ВидОплатыНаличные() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыОплатОрганизаций.Ссылка
	|ИЗ
	|	Справочник.ВидыОплатОрганизаций КАК ВидыОплатОрганизаций
	|ГДЕ
	|	ВидыОплатОрганизаций.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплат.Наличные)
	|	И НЕ ВидыОплатОрганизаций.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		
		НовыйЭлемент = Справочники.ВидыОплатОрганизаций.СоздатьЭлемент();
		
		НовыйЭлемент.ТипОплаты    = Перечисления.ТипыОплат.Наличные;
		НовыйЭлемент.Наименование = "Наличные";
		
		НовыйЭлемент.Записать();
		
		Возврат НовыйЭлемент.Ссылка;
		
	КонецЕсли;

КонецФункции

Функция ЭтоРасчетыСЭмитентамиПодарочныхСертификатов(ДоговорКонтрагента) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыОплатОрганизаций.Ссылка
	|ИЗ
	|	Справочник.ВидыОплатОрганизаций КАК ВидыОплатОрганизаций
	|ГДЕ
	|	ВидыОплатОрганизаций.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И ВидыОплатОрганизаций.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплат.ПодарочныйСертификатСторонний)"
	;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ВидыДоговоровПоТипуОплаты(ТипОплаты) Экспорт
	
	ВидыДоговоров = Новый Массив;
	
	Если ТипОплаты = Перечисления.ТипыОплат.ПодарочныйСертификатСобственный Тогда
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплат.ПодарочныйСертификатСторонний Тогда
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	Иначе
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	КонецЕсли;
	
	Возврат ВидыДоговоров;
	
КонецФункции

Функция ОрганизацииДляОтбораВидовОплат(Организация) Экспорт
	
	Организации = Новый Массив;
	Организации.Добавить(Организация);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ГоловнаяОрганизация = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация);
		Если ГоловнаяОрганизация <> Организация Тогда
			Организации.Добавить(ГоловнаяОрганизация);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Организации;
	
КонецФункции

#КонецОбласти
